In [1]:
# Pandas

In [2]:
import pandas as pd

## Reading and Writing files

In [3]:
# Reading a CSV file
df = pd.read_csv('resources/modified_SFO_Airport_Utility_Consumption.csv')

In [4]:
# Writing to a CSV file
df.to_csv("resources/modified_util.csv", index=False, header=True)

In [5]:
# Writing to an Excel file
df.to_excel("resources/modified_util.xlsx", index=False)

## Exploring Data

In [6]:
# Head of the dataframe
df.head()

,Year,Month Number,Month,Utility,Owner,units,usage,Comments
0,2013.0,NaN,Jan,Passengers,Campus,PAX,3209356.0,NaN
1,2013.0,1.0,Jan,Gas,Commission,Therms,363205.0,NaN
2,2013.0,NaN,Jan,Gas,Tenant,Therms,49393.0,NaN
3,NaN,1.0,Jan,Elec,Commission,kWh,12904353.0,NaN
4,2013.0,1.0,Jan,Electricity,Tenant,NaN,14002156.0,NaN

In [7]:
# Tail of the dataframe
df.tail()

,Year,Month Number,Month,Utility,Owner,units,usage,Comments
555,2019.0,8.0,Aug,Gas,Tenant,Therms,6.160002e+03,NaN
556,2019.0,8.0,Aug,Electricity,NaN,kWh,1.563947e+07,NaN
557,2019.0,8.0,Aug,Electricity,Tenant,kWh,1.251209e+07,NaN
558,2019.0,8.0,Aug,Water,Commission,Million Gallons,2.767076e+01,NaN
559,2019.0,8.0,Aug,NaN,Tenant,Million Gallons,1.512082e+01,NaN

In [8]:
# Shape of the dataframe
df.shape

(560, 8)

In [9]:
# Column names of the dataframe
df.columns

Index(['Year', 'Month Number', 'Month', 'Utility', 'Owner', 'units', 'usage',
       'Comments'],
      dtype='object')

In [10]:
# Count of the data in the dataframe
df.count()

Year            528
Month Number    537
Month           529
Utility         536
Owner           530
units           534
usage           530
Comments          0
dtype: int64

In [11]:
# Null values in the dataframe
df.isnull().sum()

Year             32
Month Number     23
Month            31
Utility          24
Owner            30
units            26
usage            30
Comments        560
dtype: int64

In [12]:
# Data types of the data in the dataframe
df.dtypes

Year            float64
Month Number    float64
Month            object
Utility          object
Owner            object
units            object
usage           float64
Comments        float64
dtype: object

In [13]:
df['Year'].describe()

count     528.000000
mean     2015.859848
std         1.929315
min      2013.000000
25%      2014.000000
50%      2016.000000
75%      2017.000000
max      2019.000000
Name: Year, dtype: float64

In [14]:
df.head()

,Year,Month Number,Month,Utility,Owner,units,usage,Comments
0,2013.0,NaN,Jan,Passengers,Campus,PAX,3209356.0,NaN
1,2013.0,1.0,Jan,Gas,Commission,Therms,363205.0,NaN
2,2013.0,NaN,Jan,Gas,Tenant,Therms,49393.0,NaN
3,NaN,1.0,Jan,Elec,Commission,kWh,12904353.0,NaN
4,2013.0,1.0,Jan,Electricity,Tenant,NaN,14002156.0,NaN

In [15]:
# iloc uses integer-based indexing for selection by position instead of using labels
df.iloc[2,4]

'Tenant'

In [16]:
df.iloc[2:4,3:-1]

  Utility       Owner   units       usage
2     Gas      Tenant  Therms     49393.0
3    Elec  Commission     kWh  12904353.0

In [17]:
# loc returns the data based on the column names and row indexes

In [18]:
df.loc[2,'usage']

49393.0

In [19]:
df.loc[2,'usage'] = 500000.0
df.head()

,Year,Month Number,Month,Utility,Owner,units,usage,Comments
0,2013.0,NaN,Jan,Passengers,Campus,PAX,3209356.0,NaN
1,2013.0,1.0,Jan,Gas,Commission,Therms,363205.0,NaN
2,2013.0,NaN,Jan,Gas,Tenant,Therms,500000.0,NaN
3,NaN,1.0,Jan,Elec,Commission,kWh,12904353.0,NaN
4,2013.0,1.0,Jan,Electricity,Tenant,NaN,14002156.0,NaN

In [20]:
df.loc[2:4,['units','usage']]

    units       usage
2  Therms    500000.0
3     kWh  12904353.0
4     NaN  14002156.0

In [21]:
df.loc[2:4,:]

,Year,Month Number,Month,Utility,Owner,units,usage,Comments
2,2013.0,NaN,Jan,Gas,Tenant,Therms,500000.0,NaN
3,NaN,1.0,Jan,Elec,Commission,kWh,12904353.0,NaN
4,2013.0,1.0,Jan,Electricity,Tenant,NaN,14002156.0,NaN

In [22]:
# Using loc with a condition
df.loc[df['usage'] >= 1000000].head()

,Year,Month Number,Month,Utility,Owner,units,usage,Comments
0,2013.0,NaN,Jan,Passengers,Campus,PAX,3209356.0,NaN
3,NaN,1.0,Jan,Elec,Commission,kWh,12904353.0,NaN
4,2013.0,1.0,Jan,Electricity,Tenant,NaN,14002156.0,NaN
7,2013.0,2.0,Feb,Passengers,Campus,PAX,2968951.0,NaN
11,2013.0,2.0,Feb,Electricity,Tenant,kWh,12631776.0,NaN

In [23]:
# Using loc with a condition
df.loc[df['Utility'] == 'Electricity'].head()

,Year,Month Number,Month,Utility,Owner,units,usage,Comments
4,2013.0,1.0,Jan,Electricity,Tenant,NaN,14002156.0,NaN
11,2013.0,2.0,Feb,Electricity,Tenant,kWh,12631776.0,NaN
18,2013.0,3.0,Mar,Electricity,Tenant,kWh,13894596.0,NaN
24,2013.0,4.0,Apr,Electricity,Commission,kWh,13477167.0,NaN
25,2013.0,4.0,Apr,Electricity,Tenant,kWh,NaN,NaN

In [24]:
# Using loc with multiple conditions
df.loc[(df['Utility'] == 'Electricity') & (df['usage'] > 1000000)].head()

,Year,Month Number,Month,Utility,Owner,units,usage,Comments
4,2013.0,1.0,Jan,Electricity,Tenant,NaN,14002156.0,NaN
11,2013.0,2.0,Feb,Electricity,Tenant,kWh,12631776.0,NaN
18,2013.0,3.0,Mar,Electricity,Tenant,kWh,13894596.0,NaN
24,2013.0,4.0,Apr,Electricity,Commission,kWh,13477167.0,NaN
31,2013.0,5.0,May,Electricity,Commission,kWh,14525147.0,NaN

In [25]:
# Using loc with multiple conditions
df.loc[(df['Utility'] == 'Electricity') & (df['usage'] > 1000000), ['Year','Utility','usage']].head()

      Year      Utility       usage
4   2013.0  Electricity  14002156.0
11  2013.0  Electricity  12631776.0
18  2013.0  Electricity  13894596.0
24  2013.0  Electricity  13477167.0
31  2013.0  Electricity  14525147.0

## Cleaning Data

In [26]:
df.isnull().sum()

Year             32
Month Number     23
Month            31
Utility          24
Owner            30
units            26
usage            30
Comments        560
dtype: int64

In [27]:
# Drop a column
df = df.drop('Comments', axis=1)
df.head()

     Year  Month Number Month      Utility       Owner   units       usage
0  2013.0           NaN   Jan   Passengers      Campus     PAX   3209356.0
1  2013.0           1.0   Jan          Gas  Commission  Therms    363205.0
2  2013.0           NaN   Jan          Gas      Tenant  Therms    500000.0
3     NaN           1.0   Jan         Elec  Commission     kWh  12904353.0
4  2013.0           1.0   Jan  Electricity      Tenant     NaN  14002156.0

In [28]:
# Choosing columns to work with
df = df[['Year', 'Utility', 'units', 'usage']]
df.head()

     Year      Utility   units       usage
0  2013.0   Passengers     PAX   3209356.0
1  2013.0          Gas  Therms    363205.0
2  2013.0          Gas  Therms    500000.0
3     NaN         Elec     kWh  12904353.0
4  2013.0  Electricity     NaN  14002156.0

In [29]:
# Setting a new index
df = df.set_index('Year') # set it to year
df.head()

            Utility   units       usage
Year
2013.0   Passengers     PAX   3209356.0
2013.0          Gas  Therms    363205.0
2013.0          Gas  Therms    500000.0
NaN            Elec     kWh  12904353.0
2013.0  Electricity     NaN  14002156.0

In [30]:
# Reset the index
df = df.reset_index(drop=False)
df.head()

     Year      Utility   units       usage
0  2013.0   Passengers     PAX   3209356.0
1  2013.0          Gas  Therms    363205.0
2  2013.0          Gas  Therms    500000.0
3     NaN         Elec     kWh  12904353.0
4  2013.0  Electricity     NaN  14002156.0

In [31]:
# Renaming columns
df = df.rename(columns={'units': 'Units', 'usage': 'Usage'})
df.head()

     Year      Utility   Units       Usage
0  2013.0   Passengers     PAX   3209356.0
1  2013.0          Gas  Therms    363205.0
2  2013.0          Gas  Therms    500000.0
3     NaN         Elec     kWh  12904353.0
4  2013.0  Electricity     NaN  14002156.0

In [32]:
# Null values
df.isnull().sum()

Year       32
Utility    24
Units      26
Usage      30
dtype: int64

In [33]:
# Fill null values
df['Year'] = df['Year'].fillna('2013')
df.isnull().sum()

Year        0
Utility    24
Units      26
Usage      30
dtype: int64

In [34]:
# Drop null values
df = df.dropna(how='any')
df.isnull().sum()

Year       0
Utility    0
Units      0
Usage      0
dtype: int64

In [35]:
# Unique value
df['Utility'].unique()

array(['Passengers', 'Gas', 'Elec', 'Water', 'Electricity'], dtype=object)

In [36]:
# Number of unique values
df['Utility'].nunique()

5

In [37]:
# Value counts
df['Utility'].value_counts()

Utility
Gas            141
Water          139
Electricity    136
Passengers      64
Elec             1
Name: count, dtype: int64

In [38]:
# Replacing values
df['Utility'] = df['Utility'].replace({'Elec': 'Electricity'})
df.head()

     Year      Utility            Units         Usage
0  2013.0   Passengers              PAX  3.209356e+06
1  2013.0          Gas           Therms  3.632050e+05
2  2013.0          Gas           Therms  5.000000e+05
3    2013  Electricity              kWh  1.290435e+07
5  2013.0        Water  Million Gallons  1.520235e+01

In [39]:
# Checking values after cleaning
df['Utility'].unique()

array(['Passengers', 'Gas', 'Electricity', 'Water'], dtype=object)

In [40]:
# Data types
df.dtypes

Year        object
Utility     object
Units       object
Usage      float64
dtype: object

In [41]:
df = df.astype({"Year": int})

In [42]:
df.dtypes

Year         int64
Utility     object
Units       object
Usage      float64
dtype: object

In [43]:
df.head(10)

    Year      Utility            Units         Usage
0   2013   Passengers              PAX  3.209356e+06
1   2013          Gas           Therms  3.632050e+05
2   2013          Gas           Therms  5.000000e+05
3   2013  Electricity              kWh  1.290435e+07
5   2013        Water  Million Gallons  1.520235e+01
6   2013        Water  Million Gallons  1.583441e+01
7   2013   Passengers              PAX  2.968951e+06
8   2013          Gas           Therms  3.174930e+05
9   2013          Gas           Therms  5.057300e+04
11  2013  Electricity              kWh  1.263178e+07

## Transforming Data

In [44]:
c_df = df

In [45]:
# Scale the Usage column to be more readable
# Rows with "Water" as the utility can be left as is

def scale_to_millions(row):
    if row['Utility'] == 'Water':
        return row['Usage']
    return row['Usage'] / 1000000

c_df['Usage'] = c_df.apply(scale_to_millions, axis = 1)
c_df.head()

   Year      Utility            Units      Usage
0  2013   Passengers              PAX   3.209356
1  2013          Gas           Therms   0.363205
2  2013          Gas           Therms   0.500000
3  2013  Electricity              kWh  12.904353
5  2013        Water  Million Gallons  15.202352

In [46]:
# Alter the Units column to reflect the changes
def millions_of_units(row):
    if row['Utility'] == 'Water':
        return row['Units']
    return 'Million ' + row['Units']

c_df['Units'] = c_df.apply(millions_of_units, axis = 1)
c_df.head()

   Year      Utility            Units      Usage
0  2013   Passengers      Million PAX   3.209356
1  2013          Gas   Million Therms   0.363205
2  2013          Gas   Million Therms   0.500000
3  2013  Electricity      Million kWh  12.904353
5  2013        Water  Million Gallons  15.202352

In [47]:
# Combine the Utility and Units columns
# by putting Units in parentheses

def combine_utility_and_units(row):
    return f"{row['Utility']} ({row['Units']})"

df['Utility'] = df.apply(combine_utility_and_units, axis = 1)
df.head()

   Year                    Utility            Units      Usage
0  2013   Passengers (Million PAX)      Million PAX   3.209356
1  2013       Gas (Million Therms)   Million Therms   0.363205
2  2013       Gas (Million Therms)   Million Therms   0.500000
3  2013  Electricity (Million kWh)      Million kWh  12.904353
5  2013    Water (Million Gallons)  Million Gallons  15.202352

In [48]:
df = df.drop(["Units"], axis=1)
df.head()

   Year                    Utility      Usage
0  2013   Passengers (Million PAX)   3.209356
1  2013       Gas (Million Therms)   0.363205
2  2013       Gas (Million Therms)   0.500000
3  2013  Electricity (Million kWh)  12.904353
5  2013    Water (Million Gallons)  15.202352

In [49]:
# Create two new DataFrames with data from 2013
# and 2018 that each contain only the Utility and 
# Usage column. Reset the index for each 
# DataFrame to Utility
yr_2013_df = df\
            .loc[df['Year'] == 2013, ['Utility', 'Usage']]\
            .copy()\
            .set_index('Utility')
yr_2018_df = df\
            .loc[df['Year'] == 2018, ['Utility', 'Usage']]\
            .copy()\
            .set_index('Utility')

yr_2018_df.head()

                               Usage
Utility
Gas (Million Therms)        0.273992
Gas (Million Therms)        0.057670
Electricity (Million kWh)  13.692172
Water (Million Gallons)    18.755352
Passengers (Million PAX)    3.882065

## Analyze

In [50]:
# Calculate the totals for each utility
utilities = yr_2013_df.index.unique()
print(utilities)

totals_2013 = {'Period': 2013}
totals_2018 = {'Period': 2018}

for utility in utilities:
    totals_2013[utility] = yr_2013_df.loc[utility, 'Usage'].sum()
    totals_2018[utility] = yr_2018_df.loc[utility, 'Usage'].sum()

print(totals_2013)
print(totals_2018)

Index(['Passengers (Million PAX)', 'Gas (Million Therms)',
       'Electricity (Million kWh)', 'Water (Million Gallons)'],
      dtype='object', name='Utility')
{'Period': 2013, 'Passengers (Million PAX)': 38.605191, 'Gas (Million Therms)': 4.6279121945699995, 'Electricity (Million kWh)': 394.9835020599999, 'Water (Million Gallons)': 468.377404}
{'Period': 2018, 'Passengers (Million PAX)': 42.62084, 'Gas (Million Therms)': 3.3969781519999995, 'Electricity (Million kWh)': 221.9915476, 'Water (Million Gallons)': 305.6328}

In [51]:
# Calculate the change per utility as a percentage
# of each utility's 2013 total.

def get_percentage(original, final):
    return round((final - original) / original, 3) * 100

data = []
for utility in totals_2013.keys():
    if utility == 'Period':
        continue
    original = totals_2013[utility]
    final = totals_2018[utility]
    row = {
        'Utility': utility,
        '2013': round(original, 1),
        '2018': round(final, 1),
        'Difference': round(final - original, 1),
        'Change %': get_percentage(original, final)
    }
    data.append(row)



# Create a dataframe with the results
summary_df = pd.DataFrame(data)
summary_df

                     Utility   2013   2018  Difference  Change %
0   Passengers (Million PAX)   38.6   42.6         4.0      10.4
1       Gas (Million Therms)    4.6    3.4        -1.2     -26.6
2  Electricity (Million kWh)  395.0  222.0      -173.0     -43.8
3    Water (Million Gallons)  468.4  305.6      -162.7     -34.7

In [52]:
# Set the index to the utility column
summary_df = summary_df.set_index('Utility')

# Sort the rows based on Change %
summary_df = summary_df.sort_values('Change %', ascending=False)
summary_df

                            2013   2018  Difference  Change %
Utility
Passengers (Million PAX)    38.6   42.6         4.0      10.4
Gas (Million Therms)         4.6    3.4        -1.2     -26.6
Water (Million Gallons)    468.4  305.6      -162.7     -34.7
Electricity (Million kWh)  395.0  222.0      -173.0     -43.8

In [53]:
# Numpy - numerical python library
import numpy as np

In [54]:
# SciPy - scientific python library
import scipy.stats as sts

In [55]:
# Read in the LAX temperature data
temperature_df = pd.read_csv('./resources/lax_temperature.csv')
temperature_df.head()

       STATION                 DATE REPORT_TYPE  HourlyDryBulbTemperature
0  72295023174  2019-01-01T00:49:00       FM-16                        52
1  72295023174  2019-01-01T00:53:00       FM-15                        51
2  72295023174  2019-01-01T01:53:00       FM-15                        52
3  72295023174  2019-01-01T02:53:00       FM-15                        49
4  72295023174  2019-01-01T03:53:00       FM-15                        43

In [56]:
temperatures = temperature_df['HourlyDryBulbTemperature']
temperatures.head()

0    52
1    51
2    52
3    49
4    43
Name: HourlyDryBulbTemperature, dtype: int64

In [57]:
# Measures of central tendency - try to indentify the center of a dataset
# Mean - average - use NumPy
# Median - middle of a sorted dataset - use NumPy
# Mode - value that occurs the most - use SciPy
mean_numpy = np.mean(temperatures)
print(f"The mean temperature at the LAX airport is {mean_numpy:.2f}")

median_numpy = np.median(temperatures)
print(f"The median temperature at the LAX airport is {median_numpy:.2f}")

mode_scipy = sts.mode(temperatures)
print(f"The mode temperature at the LAX airport is {mode_scipy}")

The mean temperature at the LAX airport is 57.66
The median temperature at the LAX airport is 57.00
The mode temperature at the LAX airport is ModeResult(mode=57, count=327)

In [58]:
# Variance describes how far the values in the dataset are from the mean overall - Numpy
# Describes how much variation exists in the data
# Considers the distance of each value in the dataset from the center of the data
variance = np.var(temperatures)
print(f"The population variance using the NumPy module is {variance:.2f}")

The population variance using the NumPy module is 32.33

In [59]:
# Standard deviation: describes how spread out the data is from the mean - Numpy
# Gets calculated as the square root of the variance
# Exists in the same unit of measurement as the mean and the data
stand_dev = np.std(temperatures)
print(f"The population standard deviation using the NumPy module is {stand_dev:.2f}")

The population standard deviation using the NumPy module is 5.69

In [60]:
# Z-score: the distance is in terms of standard deviations and can be positive or negative - SciPy
# Negative z-score: the value of the data point is less than the mean
# Positive z-score: the value of the data point is greater than the mean
# Smaller the z-score the closer the value is to the mean
z_scipy = sts.zscore(temperatures)
print(f"The z-scores using the SciPy module are {z_scipy}")

The z-scores using the SciPy module are 0      -0.994570
1      -1.170440
2      -0.994570
3      -1.522181
4      -2.577401
          ...
3524    0.412390
3525    0.236520
3526    0.060650
3527    0.060650
3528    0.060650
Name: HourlyDryBulbTemperature, Length: 3529, dtype: float64

In [61]:
# Quantiles, Quartiles, percentiles and outliers

In [62]:
# Quantiles: These are values that divide sorted data into well-defined bins based on the position of each point.
# The two most commonly used quantiles are quartiles and percentiles.

In [63]:
# Quartiles: These are the three values that divide the sorted data into four equally sized groups.
# Thus, 25% of the data values are less than the first quartile, 
# 50% are less than the second quartile, and 
# 75% are less than the third quartile. 
# The second quartile is also the median.
Q1 = temperatures.quantile(0.25)
median = temperatures.quantile(0.5)
Q3 = temperatures.quantile(0.75)
IQR = Q3 - Q1

print(f"The lower quartile of temperatures is: {Q1}")
print(f"The upper quartile of temperatures is: {Q3}")
print(f"The interquartile range of temperatures is: {IQR}")
print(f"The the median of temperatures is: {median} ")

lower_bound = Q1 - (1.5 * IQR)
upper_bound = Q3 + (1.5 * IQR)
print(f"Values below {lower_bound} could be outliers.")
print(f"Values above {upper_bound} could be outliers.")

The lower quartile of temperatures is: 54.0
The upper quartile of temperatures is: 60.0
The interquartile range of temperatures is: 6.0
The the median of temperatures is: 57.0
Values below 45.0 could be outliers.
Values above 69.0 could be outliers.

In [64]:
# Percentiles: These divide the sorted data into 100 equally sized groups. 
# Each percentile is named for the percentage of data values that are less than that percentile.

In [65]:
# Outliers: Multiple mathematical calculations exist to find potential outliers, 
# but in general outliers are extreme values in a dataset.
outlier_df = temperature_df.loc[(temperature_df['HourlyDryBulbTemperature'] < lower_bound) |
                                (temperature_df['HourlyDryBulbTemperature'] > upper_bound)]
outlier_df.head()

         STATION                 DATE REPORT_TYPE  HourlyDryBulbTemperature
4    72295023174  2019-01-01T03:53:00       FM-15                        43
5    72295023174  2019-01-01T04:00:00       FM-12                        43
8    72295023174  2019-01-01T06:53:00       FM-15                        44
35   72295023174  2019-01-02T05:53:00       FM-15                        40
245  72295023174  2019-01-08T12:53:00       FM-15                        70